{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.4", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "activity_regularizer": null, "input_length": 144, "name": "embedding_1", "embeddings_regularizer": null, "output_dim": 5, "dtype": "int32", "mask_zero": false, "input_dim": 256, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 144]}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_1", "kernel_size": [5], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1], "filters": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1], "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "padding": "causal"}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "strides": [1], "padding": "valid", "pool_size": [1], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 200, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "units": 3, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax"}}]}