{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 144, "output_dim": 5, "input_dim": 256, "dtype": "int32", "embeddings_regularizer": null, "activity_regularizer": null, "trainable": true, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "batch_input_shape": [null, 144], "mask_zero": false, "name": "embedding_1"}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "strides": [1], "name": "conv1d_1", "activity_regularizer": null, "kernel_size": [5], "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "causal", "activation": "relu", "bias_regularizer": null, "filters": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_size": [1], "padding": "valid", "strides": [1], "name": "max_pooling1d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "name": "dense_1", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "name": "dense_2", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true}}], "keras_version": "2.0.4"}